STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32N6xx/Include/stm32n6xxxxx.h
/**
  ******************************************************************************
  * @file    $PRODUCTNAME_LC$.h
  * @author  MCD Application Team
  * @brief   CMSIS $PRODUCTNAME_UC$ Device Peripheral Access Layer Header File.
  *
  *          This file contains:
  *           - Data structures and the address mapping for all peripherals
  *           - Peripheral's registers declarations and bits definition
  *           - Macros to access peripheral's registers hardware
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#ifndef $PRODUCTNAME_UC$_H
#define $PRODUCTNAME_UC$_H

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup ST
  * @{
  */

/** @addtogroup $PRODUCTNAME_UC$
  * @{
  */

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */
typedef enum
{
/* ======================================  ARM Cortex-M55 Specific Interrupt Numbers  ======================================== */
  NonMaskableInt_IRQn        = -14,    /*!< -14 Non maskable Interrupt, cannot be stopped or preempted                         */
  HardFault_IRQn             = -13,    /*!< -13 Hard Fault, all classes of Fault                                               */
  MemoryManagement_IRQn      = -12,    /*!< -12 Memory Management, MPU mismatch, including Access Violation and No Match       */
  BusFault_IRQn              = -11,    /*!< -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault */
  UsageFault_IRQn            = -10,    /*!< -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition                  */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  SecureFault_IRQn           = -9,     /*!< -9  Secure Fault                                                                   */
#endif
  SVCall_IRQn                = -5,     /*!< -5  System Service Call via SVC instruction                                        */
  DebugMonitor_IRQn          = -4,     /*!< -4  Debug Monitor                                                                  */
  PendSV_IRQn                = -2,     /*!< -2  Pendable request for system service                                            */
  SysTick_IRQn               = -1,     /*!< -1  System Tick Timer                                                              */

/* ======================================  STM32N6xx Specific Interrupt Numbers  ============================================= */
  PVD_PVM_IRQn               = 0,      /*!< PVD/PVM1/PVM2/PVM3/PVM4 through EXTI Line detection                                */
  DTS_IRQn                   = 2,      /*!< Thermal Sensor interruption                                                        */
  RCC_IRQn                   = 3,      /*!< RCC non-secure global interrupts through EXTI Line detection                       */
  LOCKUP_IRQn                = 4,      /*!< LOCKUP / (no Overstack in CM55)                                                    */
  CACHE_ECC_IRQn             = 5,      /*!< Error ECC cache interrupt                                                          */
  TCM_ECC_IRQn               = 6,      /*!< TCM ECC interrupts                                                                 */
  BKP_ECC_IRQn               = 7,      /*!< Backup RAM Interrupts                                                              */
  FPU_IRQn                   = 8,      /*!< FPU interrupt                                                                      */
  RTC_S_IRQn                 = 10,     /*!< RTC secure interrupts through EXTI Line detection                                  */
  TAMP_IRQn                  = 11,     /*!< Tamper secure and non-secure interrupts through EXTI Line detection                */
  RIFSC_TAMPER_IRQn          = 12,     /*!< RIF Tamper interrupts                                                              */
  IAC_IRQn                   = 13,     /*!< IAC interrupt                                                                      */
  RCC_S_IRQn                 = 14,     /*!< RCC secure global interrupts through EXTI Line detection                           */
  RTC_IRQn                   = 16,     /*!< RTC non-secure interrupts through EXTI Line detection                              */
  IWDG_IRQn                  = 18,     /*!< Internal Watchdog interrupt                                                        */
  WWDG_IRQn                  = 19,     /*!< Window Watchdog interrupt                                                          */
  EXTI0_IRQn                 = 20,     /*!< EXTI Line0 interrupt                                                               */
  EXTI1_IRQn                 = 21,     /*!< EXTI Line1 interrupt                                                               */
  EXTI2_IRQn                 = 22,     /*!< EXTI Line2 interrupt                                                               */
  EXTI3_IRQn                 = 23,     /*!< EXTI Line3 interrupt                                                               */
  EXTI4_IRQn                 = 24,     /*!< EXTI Line4 interrupt                                                               */
  EXTI5_IRQn                 = 25,     /*!< EXTI Line5 interrupt                                                               */
  EXTI6_IRQn                 = 26,     /*!< EXTI Line6 interrupt                                                               */
  EXTI7_IRQn                 = 27,     /*!< EXTI Line7 interrupt                                                               */
  EXTI8_IRQn                 = 28,     /*!< EXTI Line8 interrupt                                                               */
  EXTI9_IRQn                 = 29,     /*!< EXTI Line9 interrupt                                                               */
  EXTI10_IRQn                = 30,     /*!< EXTI Line10 interrupt                                                              */
  EXTI11_IRQn                = 31,     /*!< EXTI Line11 interrupt                                                              */
  EXTI12_IRQn                = 32,     /*!< EXTI Line12 interrupt                                                              */
  EXTI13_IRQn                = 33,     /*!< EXTI Line13 interrupt                                                              */
  EXTI14_IRQn                = 34,     /*!< EXTI Line14 interrupt                                                              */
  EXTI15_IRQn                = 35,     /*!< EXTI Line15 interrupt                                                              */
#if $N6_CRYPTO$
  SAES_IRQn                  = 36,     /*!< SAES interrupt                                                                     */
  CRYP_IRQn                  = 37,     /*!< CRYP interrupt                                                                     */
#endif
  PKA_IRQn                   = 38,     /*!< PKA interrupt                                                                      */
  HASH_IRQn                  = 39,     /*!< HASH interrupt                                                                     */
  RNG_IRQn                   = 40,     /*!< RNG global interrupt                                                               */
#if $N6_CRYPTO$
  MCE1_IRQn                  = 42,     /*!< MCE1 global interrupt                                                              */
  MCE2_IRQn                  = 43,     /*!< MCE2 global interrupt                                                              */
  MCE3_IRQn                  = 44,     /*!< MCE3 global interrupt                                                              */
  MCE4_IRQn                  = 45,     /*!< MCE4 global interrupt                                                              */
#endif
  ADC1_2_IRQn                = 46,     /*!< ADC1 & ADC2 interrupt                                                              */
  CSI_IRQn                   = 47,     /*!< CSI global interrupt                                                               */
  DCMIPP_IRQn                = 48,     /*!< DCMIPP global interrupt                                                            */
  PAHB_ERR_IRQn              = 52,     /*!< PAHB error interrupt                                                               */
#if $N6_NPU$
  NPU0_IRQn                  = 53,     /*!< NPU mst_ints[0] line interrupt                                                     */
  NPU1_IRQn                  = 54,     /*!< NPU mst_ints[1] line interrupt                                                     */
  NPU2_IRQn                  = 55,     /*!< NPU mst_ints[2] line interrupt                                                     */
  NPU3_IRQn                  = 56,     /*!< NPU mst_ints[3] line interrupt                                                     */
  CACHEAXI_IRQn              = 57,     /*!< NPU cache interrupt                                                                */
#endif
  LTDC_LO_IRQn               = 58,     /*!< LTDC low-layer global interrupt                                                    */
  LTDC_LO_ERR_IRQn           = 59,     /*!< LTDC low-layer error interrupt                                                     */
  DMA2D_IRQn                 = 60,     /*!< DMA2D global interrupt                                                             */
  JPEG_IRQn                  = 61,     /*!< JPEG global interrupt                                                              */
  VENC_IRQn                  = 62,     /*!< VENC global interrupt                                                              */
  GFXMMU_IRQn                = 63,     /*!< GFXMMU global interrupt                                                            */
  GFXTIM_IRQn                = 64,     /*!< GFXTIM global interrupt                                                            */
  GPU2D_IRQn                 = 65,     /*!< GPU2D interrupt                                                                    */
  GPU2D_ER_IRQn              = 66,     /*!< GPU2D error interrupt                                                              */
  ICACHE_IRQn                = 67,     /*!< GPU2D cache interrupt                                                              */
  HPDMA1_Channel0_IRQn       = 68,     /*!< HPDMA1 Channel 0 global interrupt                                                  */
  HPDMA1_Channel1_IRQn       = 69,     /*!< HPDMA1 Channel 1 global interrupt                                                  */
  HPDMA1_Channel2_IRQn       = 70,     /*!< HPDMA1 Channel 2 global interrupt                                                  */
  HPDMA1_Channel3_IRQn       = 71,     /*!< HPDMA1 Channel 3 global interrupt                                                  */
  HPDMA1_Channel4_IRQn       = 72,     /*!< HPDMA1 Channel 4 global interrupt                                                  */
  HPDMA1_Channel5_IRQn       = 73,     /*!< HPDMA1 Channel 5 global interrupt                                                  */
  HPDMA1_Channel6_IRQn       = 74,     /*!< HPDMA1 Channel 6 global interrupt                                                  */
  HPDMA1_Channel7_IRQn       = 75,     /*!< HPDMA1 Channel 7 global interrupt                                                  */
  HPDMA1_Channel8_IRQn       = 76,     /*!< HPDMA1 Channel 8 global interrupt                                                  */
  HPDMA1_Channel9_IRQn       = 77,     /*!< HPDMA1 Channel 9 global interrupt                                                  */
  HPDMA1_Channel10_IRQn      = 78,     /*!< HPDMA1 Channel 10 global interrupt                                                 */
  HPDMA1_Channel11_IRQn      = 79,     /*!< HPDMA1 Channel 11 global interrupt                                                 */
  HPDMA1_Channel12_IRQn      = 80,     /*!< HPDMA1 Channel 12 global interrupt                                                 */
  HPDMA1_Channel13_IRQn      = 81,     /*!< HPDMA1 Channel 13 global interrupt                                                 */
  HPDMA1_Channel14_IRQn      = 82,     /*!< HPDMA1 Channel 14 global interrupt                                                 */
  HPDMA1_Channel15_IRQn      = 83,     /*!< HPDMA1 Channel 15 global interrupt                                                 */
  GPDMA1_Channel0_IRQn       = 84,     /*!< GPDMA1 Channel 0 interrupt                                                         */
  GPDMA1_Channel1_IRQn       = 85,     /*!< GPDMA1 Channel 1 interrupt                                                         */
  GPDMA1_Channel2_IRQn       = 86,     /*!< GPDMA1 Channel 2 interrupt                                                         */
  GPDMA1_Channel3_IRQn       = 87,     /*!< GPDMA1 Channel 3 interrupt                                                         */
  GPDMA1_Channel4_IRQn       = 88,     /*!< GPDMA1 Channel 4 interrupt                                                         */
  GPDMA1_Channel5_IRQn       = 89,     /*!< GPDMA1 Channel 5 interrupt                                                         */
  GPDMA1_Channel6_IRQn       = 90,     /*!< GPDMA1 Channel 6 interrupt                                                         */
  GPDMA1_Channel7_IRQn       = 91,     /*!< GPDMA1 Channel 7 interrupt                                                         */
  GPDMA1_Channel8_IRQn       = 92,     /*!< GPDMA1 Channel 8 interrupt                                                         */
  GPDMA1_Channel9_IRQn       = 93,     /*!< GPDMA1 Channel 9 interrupt                                                         */
  GPDMA1_Channel10_IRQn      = 94,     /*!< GPDMA1 Channel 10 interrupt                                                        */
  GPDMA1_Channel11_IRQn      = 95,     /*!< GPDMA1 Channel 11 interrupt                                                        */
  GPDMA1_Channel12_IRQn      = 96,     /*!< GPDMA1 Channel 12 interrupt                                                        */
  GPDMA1_Channel13_IRQn      = 97,     /*!< GPDMA1 Channel 13 interrupt                                                        */
  GPDMA1_Channel14_IRQn      = 98,     /*!< GPDMA1 Channel 14 interrupt                                                        */
  GPDMA1_Channel15_IRQn      = 99,     /*!< GPDMA1 Channel 15 interrupt                                                        */
  I2C1_EV_IRQn               = 100,    /*!< I2C1 event interrupt                                                               */
  I2C1_ER_IRQn               = 101,    /*!< I2C1 error interrupt                                                               */
  I2C2_EV_IRQn               = 102,    /*!< I2C2 event interrupt                                                               */
  I2C2_ER_IRQn               = 103,    /*!< I2C2 error interrupt                                                               */
  I2C3_EV_IRQn               = 104,    /*!< I2C3 event interrupt                                                               */
  I2C3_ER_IRQn               = 105,    /*!< I2C3 error interrupt                                                               */
  I2C4_EV_IRQn               = 106,    /*!< I2C4 event interrupt                                                               */
  I2C4_ER_IRQn               = 107,    /*!< I2C4 error interrupt                                                               */
  I3C1_EV_IRQn               = 108,    /*!< I3C1 event interrupt                                                               */
  I3C1_ER_IRQn               = 109,    /*!< I3C1 error interrupt                                                               */
  I3C2_EV_IRQn               = 110,    /*!< I3C2 event interrupt                                                               */
  I3C2_ER_IRQn               = 111,    /*!< I3C2 error interrupt                                                               */
  TIM1_BRK_IRQn              = 112,    /*!< TIM1 Break interrupt                                                               */
  TIM1_UP_IRQn               = 113,    /*!< TIM1 Update interrupt                                                              */
  TIM1_TRG_COM_IRQn          = 114,    /*!< TIM1 Trigger and Commutation interrupt                                             */
  TIM1_CC_IRQn               = 115,    /*!< TIM1 Capture Compare interrupt                                                     */
  TIM2_IRQn                  = 116,    /*!< TIM2 global interrupt                                                              */
  TIM3_IRQn                  = 117,    /*!< TIM3 global interrupt                                                              */
  TIM4_IRQn                  = 118,    /*!< TIM4 global interrupt                                                              */
  TIM5_IRQn                  = 119,    /*!< TIM5 global interrupt                                                              */
  TIM6_IRQn                  = 120,    /*!< TIM6 global interrupt                                                              */
  TIM7_IRQn                  = 121,    /*!< TIM7 global interrupt                                                              */
  TIM8_BRK_IRQn              = 122,    /*!< TIM8 Break interrupt                                                               */
  TIM8_UP_IRQn               = 123,    /*!< TIM8 Update interrupt                                                              */
  TIM8_TRG_COM_IRQn          = 124,    /*!< TIM8 Trigger and Commutation interrupt                                             */
  TIM8_CC_IRQn               = 125,    /*!< TIM8 Capture Compare interrupt                                                     */
  TIM9_IRQn                  = 126,    /*!< TIM9 global interrupt                                                              */
  TIM10_IRQn                 = 127,    /*!< TIM10 global interrupt                                                             */
  TIM11_IRQn                 = 128,    /*!< TIM11 global interrupt                                                             */
  TIM12_IRQn                 = 129,    /*!< TIM12 global interrupt                                                             */
  TIM13_IRQn                 = 130,    /*!< TIM13 global interrupt                                                             */
  TIM14_IRQn                 = 131,    /*!< TIM14 global interrupt                                                             */
  TIM15_IRQn                 = 132,    /*!< TIM15 global interrupt                                                             */
  TIM16_IRQn                 = 133,    /*!< TIM16 global interrupt                                                             */
  TIM17_IRQn                 = 134,    /*!< TIM17 global interrupt                                                             */
  TIM18_IRQn                 = 135,    /*!< TIM18 global interrupt                                                             */
  LPTIM1_IRQn                = 136,    /*!< LPTIM1 global interrupt                                                            */
  LPTIM2_IRQn                = 137,    /*!< LPTIM2 global interrupt                                                            */
  LPTIM3_IRQn                = 138,    /*!< LPTIM3 global interrupt                                                            */
  LPTIM4_IRQn                = 139,    /*!< LPTIM4 global interrupt                                                            */
  LPTIM5_IRQn                = 140,    /*!< LPTIM5 global interrupt                                                            */
  ADF1_FLT0_IRQn             = 141,    /*!< ADF1 Filter 0 global interrupt                                                     */
  MDF1_FLT0_IRQn             = 142,    /*!< MDF1 Filter 0 global interrupt                                                     */
  MDF1_FLT1_IRQn             = 143,    /*!< MDF1 Filter 1 global interrupt                                                     */
  MDF1_FLT2_IRQn             = 144,    /*!< MDF1 Filter 2 global interrupt                                                     */
  MDF1_FLT3_IRQn             = 145,    /*!< MDF1 Filter 3 global interrupt                                                     */
  MDF1_FLT4_IRQn             = 146,    /*!< MDF1 Filter 4 global interrupt                                                     */
  MDF1_FLT5_IRQn             = 147,    /*!< MDF1 Filter 5 global interrupt                                                     */
  SAI1_A_IRQn                = 148,    /*!< Serial Audio Interface 1 block A interrupt                                         */
  SAI1_B_IRQn                = 149,    /*!< Serial Audio Interface 1 block B interrupt                                         */
  SAI2_A_IRQn                = 150,    /*!< Serial Audio Interface 2 block A interrupt                                         */
  SAI2_B_IRQn                = 151,    /*!< Serial Audio Interface 2 block B interrupt                                         */
  SPDIFRX1_IRQn              = 152,    /*!< SPDIFRX1 interrupt                                                                 */
  SPI1_IRQn                  = 153,    /*!< SPI1 global interrupt                                                              */
  SPI2_IRQn                  = 154,    /*!< SPI2 global interrupt                                                              */
  SPI3_IRQn                  = 155,    /*!< SPI3 global interrupt                                                              */
  SPI4_IRQn                  = 156,    /*!< SPI4 global interrupt                                                              */
  SPI5_IRQn                  = 157,    /*!< SPI5 global interrupt                                                              */
  SPI6_IRQn                  = 158,    /*!< SPI6 global interrupt                                                              */
  USART1_IRQn                = 159,    /*!< USART1 global interrupt                                                            */
  USART2_IRQn                = 160,    /*!< USART2 global interrupt                                                            */
  USART3_IRQn                = 161,    /*!< USART3 global interrupt                                                            */
  UART4_IRQn                 = 162,    /*!< UART4 global interrupt                                                             */
  UART5_IRQn                 = 163,    /*!< UART5 global interrupt                                                             */
  USART6_IRQn                = 164,    /*!< USART3 global interrupt                                                            */
  UART7_IRQn                 = 165,    /*!< UART7 global interrupt                                                             */
  UART8_IRQn                 = 166,    /*!< UART8 global interrupt                                                             */
