STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32N6xx/Include/stm32n6xxxxx.h
/*!< Unique device ID register base address */
#define UID_BASE_S                      (0x56009014UL)

/*!< Revision ID base address */
#define REVID_BASE_S                    (BOOTROM_BASE_S + 0x001004UL)

#endif

/** @} */ /* End of group STM32N6xx_Peripheral_peripheralAddr */

/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */
/** @addtogroup STM32N6xx_Peripheral_declaration
  * @{
  */
#define ADC12_COMMON_NS           ((ADC_Common_TypeDef *) ADC12_COMMON_BASE_NS)
#define ADC1_NS                   ((ADC_TypeDef *) ADC1_BASE_NS)
#define ADC2_NS                   ((ADC_TypeDef *) ADC2_BASE_NS)
#define ADF1_NS                   ((MDF_TypeDef *) ADF1_BASE_NS)
#define ADF1_Filter0_NS           ((MDF_Filter_TypeDef *) ADF1_Filter0_BASE_NS)
#define BSEC_NS                   ((BSEC_TypeDef *) BSEC_BASE_NS)
#if $N6_NPU$
#define CACHEAXI_NS               ((CACHEAXI_TypeDef *) CACHEAXI_BASE_NS)
#endif
#define CRC_NS                    ((CRC_TypeDef *) CRC_BASE_NS)
#if $N6_CRYPTO$
#define CRYP_NS                   ((CRYP_TypeDef *) CRYP_BASE_NS)
#endif
#define CSI_NS                    ((CSI_TypeDef *) CSI_BASE_NS)
#define DBGMCU_NS                 ((DBGMCU_TypeDef *) DBGMCU_BASE_NS)
#define DCMI_NS                   ((DCMI_TypeDef *) DCMI_BASE_NS)
#define DCMIPP_NS                 ((DCMIPP_TypeDef *) DCMIPP_BASE_NS)
#define DLYB_SDMMC1_NS            ((DLYB_TypeDef *) DLYB_SDMMC1_BASE_NS)
#define DLYB_SDMMC2_NS            ((DLYB_TypeDef *) DLYB_SDMMC2_BASE_NS)
#define DMA2D_NS                  ((DMA2D_TypeDef *) DMA2D_BASE_NS)
#define DTS_NS                    ((DTS_TypeDef *) DTS_BASE_NS)
#define DTS_Sensor0_NS            ((DTS_SensorTypeDef *) DTS_Sensor0_BASE_NS)
#define DTS_Sensor1_NS            ((DTS_SensorTypeDef *) DTS_Sensor1_BASE_NS)
#define ETH1_NS                   ((ETH_TypeDef *) ETH1_BASE_NS)
#define EXTI_NS                   ((EXTI_TypeDef *) EXTI_BASE_NS)
#define FDCAN1_NS                 ((FDCAN_GlobalTypeDef *) FDCAN1_BASE_NS)
#define FDCAN2_NS                 ((FDCAN_GlobalTypeDef *) FDCAN2_BASE_NS)
#define FDCAN3_NS                 ((FDCAN_GlobalTypeDef *) FDCAN3_BASE_NS)
#define FDCAN_CCU_NS              ((FDCAN_ClockCalibrationUnit_TypeDef *) FDCAN_CCU_BASE_NS)
#define FMC_Bank1E_R_NS           ((FMC_Bank1E_TypeDef *) FMC_Bank1E_R_BASE_NS)
#define FMC_Bank1_R_NS            ((FMC_Bank1_TypeDef *) FMC_Bank1_R_BASE_NS)
#define FMC_Bank3_R_NS            ((FMC_Bank3_TypeDef *) FMC_Bank3_R_BASE_NS)
#define FMC_Bank5_6_R_NS          ((FMC_Bank5_6_TypeDef *) FMC_Bank5_6_R_BASE_NS)
#define FMC_Common_R_NS           ((FMC_Common_TypeDef *) FMC_Common_R_BASE_NS)
#define GFXMMU_NS                 ((GFXMMU_TypeDef *) GFXMMU_BASE_NS)
#define GFXTIM_NS                 ((GFXTIM_TypeDef *) GFXTIM_BASE_NS)
#define GPDMA1_NS                 ((DMA_TypeDef *) GPDMA1_BASE_NS)
#define GPDMA1_Channel0_NS        ((DMA_Channel_TypeDef *) GPDMA1_Channel0_BASE_NS)
#define GPDMA1_Channel1_NS        ((DMA_Channel_TypeDef *) GPDMA1_Channel1_BASE_NS)
#define GPDMA1_Channel2_NS        ((DMA_Channel_TypeDef *) GPDMA1_Channel2_BASE_NS)
#define GPDMA1_Channel3_NS        ((DMA_Channel_TypeDef *) GPDMA1_Channel3_BASE_NS)
#define GPDMA1_Channel4_NS        ((DMA_Channel_TypeDef *) GPDMA1_Channel4_BASE_NS)
#define GPDMA1_Channel5_NS        ((DMA_Channel_TypeDef *) GPDMA1_Channel5_BASE_NS)
#define GPDMA1_Channel6_NS        ((DMA_Channel_TypeDef *) GPDMA1_Channel6_BASE_NS)
#define GPDMA1_Channel7_NS        ((DMA_Channel_TypeDef *) GPDMA1_Channel7_BASE_NS)
#define GPDMA1_Channel8_NS        ((DMA_Channel_TypeDef *) GPDMA1_Channel8_BASE_NS)
#define GPDMA1_Channel9_NS        ((DMA_Channel_TypeDef *) GPDMA1_Channel9_BASE_NS)
#define GPDMA1_Channel10_NS       ((DMA_Channel_TypeDef *) GPDMA1_Channel10_BASE_NS)
#define GPDMA1_Channel11_NS       ((DMA_Channel_TypeDef *) GPDMA1_Channel11_BASE_NS)
#define GPDMA1_Channel12_NS       ((DMA_Channel_TypeDef *) GPDMA1_Channel12_BASE_NS)
#define GPDMA1_Channel13_NS       ((DMA_Channel_TypeDef *) GPDMA1_Channel13_BASE_NS)
#define GPDMA1_Channel14_NS       ((DMA_Channel_TypeDef *) GPDMA1_Channel14_BASE_NS)
#define GPDMA1_Channel15_NS       ((DMA_Channel_TypeDef *) GPDMA1_Channel15_BASE_NS)
#define GPIOA_NS                  ((GPIO_TypeDef *) GPIOA_BASE_NS)
#define GPIOB_NS                  ((GPIO_TypeDef *) GPIOB_BASE_NS)
#define GPIOC_NS                  ((GPIO_TypeDef *) GPIOC_BASE_NS)
#define GPIOD_NS                  ((GPIO_TypeDef *) GPIOD_BASE_NS)
#define GPIOE_NS                  ((GPIO_TypeDef *) GPIOE_BASE_NS)
#define GPIOF_NS                  ((GPIO_TypeDef *) GPIOF_BASE_NS)
#define GPIOG_NS                  ((GPIO_TypeDef *) GPIOG_BASE_NS)
#define GPIOH_NS                  ((GPIO_TypeDef *) GPIOH_BASE_NS)
#define GPION_NS                  ((GPIO_TypeDef *) GPION_BASE_NS)
#define GPIOO_NS                  ((GPIO_TypeDef *) GPIOO_BASE_NS)
#define GPIOP_NS                  ((GPIO_TypeDef *) GPIOP_BASE_NS)
#define GPIOQ_NS                  ((GPIO_TypeDef *) GPIOQ_BASE_NS)
#define HASH_NS                   ((HASH_TypeDef *) HASH_BASE_NS)
#define HASH_DIGEST_NS            ((HASH_DIGEST_TypeDef *) HASH_DIGEST_BASE_NS)
#define HPDMA1_NS                 ((DMA_TypeDef *) HPDMA1_BASE_NS)
#define HPDMA1_Channel0_NS        ((DMA_Channel_TypeDef *) HPDMA1_Channel0_BASE_NS)
#define HPDMA1_Channel1_NS        ((DMA_Channel_TypeDef *) HPDMA1_Channel1_BASE_NS)
#define HPDMA1_Channel2_NS        ((DMA_Channel_TypeDef *) HPDMA1_Channel2_BASE_NS)
#define HPDMA1_Channel3_NS        ((DMA_Channel_TypeDef *) HPDMA1_Channel3_BASE_NS)
#define HPDMA1_Channel4_NS        ((DMA_Channel_TypeDef *) HPDMA1_Channel4_BASE_NS)
#define HPDMA1_Channel5_NS        ((DMA_Channel_TypeDef *) HPDMA1_Channel5_BASE_NS)
#define HPDMA1_Channel6_NS        ((DMA_Channel_TypeDef *) HPDMA1_Channel6_BASE_NS)
#define HPDMA1_Channel7_NS        ((DMA_Channel_TypeDef *) HPDMA1_Channel7_BASE_NS)
#define HPDMA1_Channel8_NS        ((DMA_Channel_TypeDef *) HPDMA1_Channel8_BASE_NS)
#define HPDMA1_Channel9_NS        ((DMA_Channel_TypeDef *) HPDMA1_Channel9_BASE_NS)
#define HPDMA1_Channel10_NS       ((DMA_Channel_TypeDef *) HPDMA1_Channel10_BASE_NS)
#define HPDMA1_Channel11_NS       ((DMA_Channel_TypeDef *) HPDMA1_Channel11_BASE_NS)
#define HPDMA1_Channel12_NS       ((DMA_Channel_TypeDef *) HPDMA1_Channel12_BASE_NS)
#define HPDMA1_Channel13_NS       ((DMA_Channel_TypeDef *) HPDMA1_Channel13_BASE_NS)
#define HPDMA1_Channel14_NS       ((DMA_Channel_TypeDef *) HPDMA1_Channel14_BASE_NS)
#define HPDMA1_Channel15_NS       ((DMA_Channel_TypeDef *) HPDMA1_Channel15_BASE_NS)
#define I2C1_NS                   ((I2C_TypeDef *) I2C1_BASE_NS)
#define I2C2_NS                   ((I2C_TypeDef *) I2C2_BASE_NS)
#define I2C3_NS                   ((I2C_TypeDef *) I2C3_BASE_NS)
#define I2C4_NS                   ((I2C_TypeDef *) I2C4_BASE_NS)
#define I3C1_NS                   ((I3C_TypeDef *) I3C1_BASE_NS)
#define I3C2_NS                   ((I3C_TypeDef *) I3C2_BASE_NS)
#define ICACHE_NS                 ((ICACHE_TypeDef *) ICACHE_BASE_NS)
#define IWDG_NS                   ((IWDG_TypeDef *) IWDG_BASE_NS)
#define JPEG_NS                   ((JPEG_TypeDef *) JPEG_BASE_NS)
#define LPTIM1_NS                 ((LPTIM_TypeDef *) LPTIM1_BASE_NS)
#define LPTIM2_NS                 ((LPTIM_TypeDef *) LPTIM2_BASE_NS)
#define LPTIM3_NS                 ((LPTIM_TypeDef *) LPTIM3_BASE_NS)
#define LPTIM4_NS                 ((LPTIM_TypeDef *) LPTIM4_BASE_NS)
#define LPTIM5_NS                 ((LPTIM_TypeDef *) LPTIM5_BASE_NS)
#define LPUART1_NS                ((USART_TypeDef *) LPUART1_BASE_NS)
#define LTDC_NS                   ((LTDC_TypeDef *)LTDC_BASE_NS)
#define LTDC_Layer1_NS            ((LTDC_Layer_TypeDef *)LTDC_Layer1_BASE_NS)
#define LTDC_Layer2_NS            ((LTDC_Layer_TypeDef *)LTDC_Layer2_BASE_NS)
#if $N6_CRYPTO$
#define MCE1_NS                   ((MCE_TypeDef *) MCE1_BASE_NS)
#define MCE1_REGION1_NS           ((MCE_Region_TypeDef *) MCE1_REGION1_BASE_NS)
#define MCE1_REGION2_NS           ((MCE_Region_TypeDef *) MCE1_REGION2_BASE_NS)
#define MCE1_REGION3_NS           ((MCE_Region_TypeDef *) MCE1_REGION3_BASE_NS)
#define MCE1_REGION4_NS           ((MCE_Region_TypeDef *) MCE1_REGION4_BASE_NS)
#define MCE1_CONTEXT1_NS          ((MCE_Context_TypeDef *) MCE1_CONTEXT1_BASE_NS)
#define MCE1_CONTEXT2_NS          ((MCE_Context_TypeDef *) MCE1_CONTEXT2_BASE_NS)
#define MCE2_NS                   ((MCE_TypeDef *) MCE2_BASE_NS)
#define MCE2_REGION1_NS           ((MCE_Region_TypeDef *) MCE2_REGION1_BASE_NS)
#define MCE2_REGION2_NS           ((MCE_Region_TypeDef *) MCE2_REGION2_BASE_NS)
#define MCE2_REGION3_NS           ((MCE_Region_TypeDef *) MCE2_REGION3_BASE_NS)
#define MCE2_REGION4_NS           ((MCE_Region_TypeDef *) MCE2_REGION4_BASE_NS)
#define MCE2_CONTEXT1_NS          ((MCE_Context_TypeDef *) MCE2_CONTEXT1_BASE_NS)
#define MCE2_CONTEXT2_NS          ((MCE_Context_TypeDef *) MCE2_CONTEXT2_BASE_NS)
#define MCE3_NS                   ((MCE_TypeDef *) MCE3_BASE_NS)
#define MCE3_REGION1_NS           ((MCE_Region_TypeDef *) MCE3_REGION1_BASE_NS)
#define MCE3_REGION2_NS           ((MCE_Region_TypeDef *) MCE3_REGION2_BASE_NS)
#define MCE3_REGION3_NS           ((MCE_Region_TypeDef *) MCE3_REGION3_BASE_NS)
#define MCE3_REGION4_NS           ((MCE_Region_TypeDef *) MCE3_REGION4_BASE_NS)
#define MCE3_CONTEXT1_NS          ((MCE_Context_TypeDef *) MCE3_CONTEXT1_BASE_NS)
#define MCE3_CONTEXT2_NS          ((MCE_Context_TypeDef *) MCE3_CONTEXT2_BASE_NS)
#define MCE4_NS                   ((MCE_TypeDef *) MCE4_BASE_NS)
#define MCE4_REGION1_NS           ((MCE_Region_TypeDef *) MCE4_REGION1_BASE_NS)
#define MCE4_REGION2_NS           ((MCE_Region_TypeDef *) MCE4_REGION2_BASE_NS)
#define MCE4_REGION3_NS           ((MCE_Region_TypeDef *) MCE4_REGION3_BASE_NS)
#define MCE4_REGION4_NS           ((MCE_Region_TypeDef *) MCE4_REGION4_BASE_NS)
#define MCE4_CONTEXT1_NS          ((MCE_Context_TypeDef *) MCE4_CONTEXT1_BASE_NS)
#define MCE4_CONTEXT2_NS          ((MCE_Context_TypeDef *) MCE4_CONTEXT2_BASE_NS)
#endif
#define MDF1_NS                   ((MDF_TypeDef *) MDF1_BASE_NS)
#define MDF1_Filter0_NS           ((MDF_Filter_TypeDef *) MDF1_Filter0_BASE_NS)
#define MDF1_Filter1_NS           ((MDF_Filter_TypeDef *) MDF1_Filter1_BASE_NS)
#define MDF1_Filter2_NS           ((MDF_Filter_TypeDef *) MDF1_Filter2_BASE_NS)
#define MDF1_Filter3_NS           ((MDF_Filter_TypeDef *) MDF1_Filter3_BASE_NS)
#define MDF1_Filter4_NS           ((MDF_Filter_TypeDef *) MDF1_Filter4_BASE_NS)
#define MDF1_Filter5_NS           ((MDF_Filter_TypeDef *) MDF1_Filter5_BASE_NS)
#define MDIOS_NS                  ((MDIOS_TypeDef *) MDIOS_BASE_NS)
#define PKA_NS                    ((PKA_TypeDef *) PKA_BASE_NS)
#define PSSI_NS                   ((PSSI_TypeDef *) PSSI_BASE_NS)
#define PWR_NS                    ((PWR_TypeDef *) PWR_BASE_NS)
#define RAMCFG_NS                 ((RAMCFG_TypeDef *) RAMCFG_BASE_NS)
#define RAMCFG_SRAM1_AXI_NS       ((RAMCFG_TypeDef *) RAMCFG_SRAM1_AXI_BASE_NS)
#define RAMCFG_SRAM2_AXI_NS       ((RAMCFG_TypeDef *) RAMCFG_SRAM2_AXI_BASE_NS)
#define RAMCFG_SRAM3_AXI_NS       ((RAMCFG_TypeDef *) RAMCFG_SRAM3_AXI_BASE_NS)
#define RAMCFG_SRAM4_AXI_NS       ((RAMCFG_TypeDef *) RAMCFG_SRAM4_AXI_BASE_NS)
#define RAMCFG_SRAM5_AXI_NS       ((RAMCFG_TypeDef *) RAMCFG_SRAM5_AXI_BASE_NS)
#define RAMCFG_SRAM6_AXI_NS       ((RAMCFG_TypeDef *) RAMCFG_SRAM6_AXI_BASE_NS)
#define RAMCFG_SRAM1_AHB_NS       ((RAMCFG_TypeDef *) RAMCFG_SRAM1_AHB_BASE_NS)
#define RAMCFG_SRAM2_AHB_NS       ((RAMCFG_TypeDef *) RAMCFG_SRAM2_AHB_BASE_NS)
#define RAMCFG_VENC_RAM_NS        ((RAMCFG_TypeDef *) RAMCFG_VENC_RAM_BASE_NS)
#define RAMCFG_BKPSRAM_NS         ((RAMCFG_TypeDef *) RAMCFG_BKPSRAM_BASE_NS)
#define RAMCFG_FLEXRAM_NS         ((RAMCFG_TypeDef *) RAMCFG_FLEXRAM_BASE_NS)
#define RCC_NS                    ((RCC_TypeDef *) RCC_BASE_NS)
#define RIFSC_NS                  ((RIFSC_TypeDef *) RIFSC_BASE_NS)
#define RISAF1_NS                 ((RISAF_TypeDef *) RISAF1_BASE_NS)
#define RISAF2_NS                 ((RISAF_TypeDef *) RISAF2_BASE_NS)
#define RISAF3_NS                 ((RISAF_TypeDef *) RISAF3_BASE_NS)
#if $N6_NPU$
#define RISAF4_NS                 ((RISAF_TypeDef *) RISAF4_BASE_NS)
#define RISAF5_NS                 ((RISAF_TypeDef *) RISAF5_BASE_NS)
#endif
#define RISAF6_NS                 ((RISAF_TypeDef *) RISAF6_BASE_NS)
#define RISAF7_NS                 ((RISAF_TypeDef *) RISAF7_BASE_NS)
#define RISAF8_NS                 ((RISAF_TypeDef *) RISAF8_BASE_NS)
#define RISAF9_NS                 ((RISAF_TypeDef *) RISAF9_BASE_NS)
#define RISAF11_NS                ((RISAF_TypeDef *) RISAF11_BASE_NS)
#define RISAF12_NS                ((RISAF_TypeDef *) RISAF12_BASE_NS)
#define RISAF13_NS                ((RISAF_TypeDef *) RISAF13_BASE_NS)
#define RISAF14_NS                ((RISAF_TypeDef *) RISAF14_BASE_NS)
#if $N6_NPU$
#define RISAF15_NS                ((RISAF_TypeDef *) RISAF15_BASE_NS)
#endif
#define RISAF21_NS                ((RISAF_TypeDef *) RISAF21_BASE_NS)
#define RISAF22_NS                ((RISAF_TypeDef *) RISAF22_BASE_NS)
#define RISAF23_NS                ((RISAF_TypeDef *) RISAF23_BASE_NS)
#define RNG_NS                    ((RNG_TypeDef *) RNG_BASE_NS)
#define RTC_NS                    ((RTC_TypeDef *) RTC_BASE_NS)
#if $N6_CRYPTO$
#define SAES_NS                   ((SAES_TypeDef *) SAES_BASE_NS)
#endif
#define SAI1_NS                   ((SAI_TypeDef *) SAI1_BASE_NS)
#define SAI1_Block_A_NS           ((SAI_Block_TypeDef *) SAI1_Block_A_BASE_NS)
#define SAI1_Block_B_NS           ((SAI_Block_TypeDef *) SAI1_Block_B_BASE_NS)
#define SAI2_NS                   ((SAI_TypeDef *) SAI2_BASE_NS)
#define SAI2_Block_A_NS           ((SAI_Block_TypeDef *) SAI2_Block_A_BASE_NS)
#define SAI2_Block_B_NS           ((SAI_Block_TypeDef *) SAI2_Block_B_BASE_NS)
#define SDMMC1_NS                 ((SDMMC_TypeDef *) SDMMC1_BASE_NS)
#define SDMMC2_NS                 ((SDMMC_TypeDef *) SDMMC2_BASE_NS)
#define SPDIFRX_NS                ((SPDIFRX_TypeDef *) SPDIFRX_BASE_NS)
#define SPI1_NS                   ((SPI_TypeDef *) SPI1_BASE_NS)
#define SPI2_NS                   ((SPI_TypeDef *) SPI2_BASE_NS)
#define SPI3_NS                   ((SPI_TypeDef *) SPI3_BASE_NS)
#define SPI4_NS                   ((SPI_TypeDef *) SPI4_BASE_NS)
#define SPI5_NS                   ((SPI_TypeDef *) SPI5_BASE_NS)
#define SPI6_NS                   ((SPI_TypeDef *) SPI6_BASE_NS)
#define SYSCFG_NS                 ((SYSCFG_TypeDef *) SYSCFG_BASE_NS)
#define TAMP_NS                   ((TAMP_TypeDef *) TAMP_BASE_NS)
#define TIM1_NS                   ((TIM_TypeDef *) TIM1_BASE_NS)
#define TIM2_NS                   ((TIM_TypeDef *) TIM2_BASE_NS)
#define TIM3_NS                   ((TIM_TypeDef *) TIM3_BASE_NS)
#define TIM4_NS                   ((TIM_TypeDef *) TIM4_BASE_NS)
#define TIM5_NS                   ((TIM_TypeDef *) TIM5_BASE_NS)
#define TIM6_NS                   ((TIM_TypeDef *) TIM6_BASE_NS)
#define TIM7_NS                   ((TIM_TypeDef *) TIM7_BASE_NS)
#define TIM8_NS                   ((TIM_TypeDef *) TIM8_BASE_NS)
#define TIM9_NS                   ((TIM_TypeDef *) TIM9_BASE_NS)
#define TIM10_NS                  ((TIM_TypeDef *) TIM10_BASE_NS)
#define TIM11_NS                  ((TIM_TypeDef *) TIM11_BASE_NS)
#define TIM12_NS                  ((TIM_TypeDef *) TIM12_BASE_NS)
#define TIM13_NS                  ((TIM_TypeDef *) TIM13_BASE_NS)
#define TIM14_NS                  ((TIM_TypeDef *) TIM14_BASE_NS)
#define TIM15_NS                  ((TIM_TypeDef *) TIM15_BASE_NS)
#define TIM16_NS                  ((TIM_TypeDef *) TIM16_BASE_NS)
#define TIM17_NS                  ((TIM_TypeDef *) TIM17_BASE_NS)
#define TIM18_NS                  ((TIM_TypeDef *) TIM18_BASE_NS)
#define UART4_NS                  ((USART_TypeDef *) UART4_BASE_NS)
#define UART5_NS                  ((USART_TypeDef *) UART5_BASE_NS)
#define UART7_NS                  ((USART_TypeDef *) UART7_BASE_NS)
#define UART8_NS                  ((USART_TypeDef *) UART8_BASE_NS)
#define UART9_NS                  ((USART_TypeDef *) UART9_BASE_NS)
#define UCPD1_NS                  ((UCPD_TypeDef *) UCPD1_BASE_NS)
#define USART1_NS                 ((USART_TypeDef *) USART1_BASE_NS)
#define USART2_NS                 ((USART_TypeDef *) USART2_BASE_NS)
#define USART3_NS                 ((USART_TypeDef *) USART3_BASE_NS)
#define USART6_NS                 ((USART_TypeDef *) USART6_BASE_NS)
#define USART10_NS                ((USART_TypeDef *) USART10_BASE_NS)
#define USB1_OTG_HS_NS            ((USB_OTG_GlobalTypeDef *) USB1_OTG_HS_BASE_NS)
#define USB2_OTG_HS_NS            ((USB_OTG_GlobalTypeDef *) USB2_OTG_HS_BASE_NS)
#define USB1_HS_PHYC_NS           ((USB_HS_PHYC_GlobalTypeDef *) USB1_HS_PHYC_BASE_NS)
#define USB2_HS_PHYC_NS           ((USB_HS_PHYC_GlobalTypeDef *) USB2_HS_PHYC_BASE_NS)
#define VENC_NS                   ((VENC_TypeDef *) VENC_BASE_NS)
#define VREFBUF_NS                ((VREFBUF_TypeDef *) VREFBUF_BASE_NS)
#define WWDG_NS                   ((WWDG_TypeDef *) WWDG_BASE_NS)
#define XSPI1_NS                  ((XSPI_TypeDef *) XSPI1_BASE_NS)
#define XSPI2_NS                  ((XSPI_TypeDef *) XSPI2_BASE_NS)
#define XSPI3_NS                  ((XSPI_TypeDef *) XSPI3_BASE_NS)
#define XSPIM_NS                  ((XSPIM_TypeDef *) XSPIM_BASE_NS)

