STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32N6xx/Include/stm32n6xxxxx.h
#define HPDMA1_Channel9           HPDMA1_Channel9_NS
#define HPDMA1_Channel9_BASE      HPDMA1_Channel9_BASE_NS

#define HPDMA1_Channel10          HPDMA1_Channel10_NS
#define HPDMA1_Channel10_BASE     HPDMA1_Channel10_BASE_NS

#define HPDMA1_Channel11          HPDMA1_Channel11_NS
#define HPDMA1_Channel11_BASE     HPDMA1_Channel11_BASE_NS

#define HPDMA1_Channel12          HPDMA1_Channel12_NS
#define HPDMA1_Channel12_BASE     HPDMA1_Channel12_BASE_NS

#define HPDMA1_Channel13          HPDMA1_Channel13_NS
#define HPDMA1_Channel13_BASE     HPDMA1_Channel13_BASE_NS

#define HPDMA1_Channel14          HPDMA1_Channel14_NS
#define HPDMA1_Channel14_BASE     HPDMA1_Channel14_BASE_NS

#define HPDMA1_Channel15          HPDMA1_Channel15_NS
#define HPDMA1_Channel15_BASE     HPDMA1_Channel15_BASE_NS

#define I2C1                      I2C1_NS
#define I2C1_BASE                 I2C1_BASE_NS

#define I2C2                      I2C2_NS
#define I2C2_BASE                 I2C2_BASE_NS

#define I2C3                      I2C3_NS
#define I2C3_BASE                 I2C3_BASE_NS

#define I2C4                      I2C4_NS
#define I2C4_BASE                 I2C4_BASE_NS

#define I3C1                      I3C1_NS
#define I3C1_BASE                 I3C1_BASE_NS

#define I3C2                      I3C2_NS
#define I3C2_BASE                 I3C2_BASE_NS

#define ICACHE                    ICACHE_NS
#define ICACHE_BASE               ICACHE_BASE_NS

#define IWDG                      IWDG_NS
#define IWDG_BASE                 IWDG_BASE_NS

#define JPEG                      JPEG_NS
#define JPEG_BASE                 JPEG_BASE_NS

#define LPTIM1                    LPTIM1_NS
#define LPTIM1_BASE               LPTIM1_BASE_NS

#define LPTIM2                    LPTIM2_NS
#define LPTIM2_BASE               LPTIM2_BASE_NS

#define LPTIM3                    LPTIM3_NS
#define LPTIM3_BASE               LPTIM3_BASE_NS

#define LPTIM4                    LPTIM4_NS
#define LPTIM4_BASE               LPTIM4_BASE_NS

#define LPTIM5                    LPTIM5_NS
#define LPTIM5_BASE               LPTIM5_BASE_NS

#define LPUART1                   LPUART1_NS
#define LPUART1_BASE              LPUART1_BASE_NS

#define LTDC                      LTDC_NS
#define LTDC_BASE                 LTDC_BASE_NS

#define LTDC_Layer1               LTDC_Layer1_NS
#define LTDC_Layer1_BASE          LTDC_Layer1_BASE_NS

#define LTDC_Layer2               LTDC_Layer2_NS
#define LTDC_Layer2_BASE          LTDC_Layer2_BASE_NS

#if $N6_CRYPTO$
#define MCE1                      MCE1_NS
#define MCE1_BASE                 MCE1_BASE_NS

#define MCE1_REGION1              MCE1_REGION1_NS
#define MCE1_REGION1_BASE         MCE1_REGION1_BASE_NS

#define MCE1_REGION2              MCE1_REGION2_NS
#define MCE1_REGION2_BASE         MCE1_REGION2_BASE_NS

#define MCE1_REGION3              MCE1_REGION3_NS
#define MCE1_REGION3_BASE         MCE1_REGION3_BASE_NS

#define MCE1_REGION4              MCE1_REGION4_NS
#define MCE1_REGION4_BASE         MCE1_REGION4_BASE_NS

#define MCE1_CONTEXT1             MCE1_CONTEXT1_NS
#define MCE1_CONTEXT1_BASE        MCE1_CONTEXT1_BASE_NS

#define MCE1_CONTEXT2             MCE1_CONTEXT2_NS
#define MCE1_CONTEXT2_BASE        MCE1_CONTEXT2_BASE_NS

#define MCE2                      MCE2_NS
#define MCE2_BASE                 MCE2_BASE_NS

#define MCE2_REGION1              MCE2_REGION1_NS
#define MCE2_REGION1_BASE         MCE2_REGION1_BASE_NS

#define MCE2_REGION2              MCE2_REGION2_NS
#define MCE2_REGION2_BASE         MCE2_REGION2_BASE_NS

#define MCE2_REGION3              MCE2_REGION3_NS
#define MCE2_REGION3_BASE         MCE2_REGION3_BASE_NS

#define MCE2_REGION4              MCE2_REGION4_NS
#define MCE2_REGION4_BASE         MCE2_REGION4_BASE_NS

#define MCE2_CONTEXT1             MCE2_CONTEXT1_NS
#define MCE2_CONTEXT1_BASE        MCE2_CONTEXT1_BASE_NS

#define MCE2_CONTEXT2             MCE2_CONTEXT2_NS
#define MCE2_CONTEXT2_BASE        MCE2_CONTEXT2_BASE_NS

#define MCE3                      MCE3_NS
#define MCE3_BASE                 MCE3_BASE_NS

#define MCE3_REGION1              MCE3_REGION1_NS
#define MCE3_REGION1_BASE         MCE3_REGION1_BASE_NS

#define MCE3_REGION2              MCE3_REGION2_NS
#define MCE3_REGION2_BASE         MCE3_REGION2_BASE_NS

#define MCE3_REGION3              MCE3_REGION3_NS
#define MCE3_REGION3_BASE         MCE3_REGION3_BASE_NS

#define MCE3_REGION4              MCE3_REGION4_NS
#define MCE3_REGION4_BASE         MCE3_REGION4_BASE_NS

#define MCE3_CONTEXT1             MCE3_CONTEXT1_NS
#define MCE3_CONTEXT1_BASE        MCE3_CONTEXT1_BASE_NS

#define MCE3_CONTEXT2             MCE3_CONTEXT2_NS
#define MCE3_CONTEXT2_BASE        MCE3_CONTEXT2_BASE_NS

#define MCE4                      MCE4_NS
#define MCE4_BASE                 MCE4_BASE_NS

#define MCE4_REGION1              MCE4_REGION1_NS
#define MCE4_REGION1_BASE         MCE4_REGION1_BASE_NS

#define MCE4_REGION2              MCE4_REGION2_NS
#define MCE4_REGION2_BASE         MCE4_REGION2_BASE_NS

#define MCE4_REGION3              MCE4_REGION3_NS
#define MCE4_REGION3_BASE         MCE4_REGION3_BASE_NS

#define MCE4_REGION4              MCE4_REGION4_NS
#define MCE4_REGION4_BASE         MCE4_REGION4_BASE_NS

#define MCE4_CONTEXT1             MCE4_CONTEXT1_NS
#define MCE4_CONTEXT1_BASE        MCE4_CONTEXT1_BASE_NS

#define MCE4_CONTEXT2             MCE4_CONTEXT2_NS
#define MCE4_CONTEXT2_BASE        MCE4_CONTEXT2_BASE_NS
#endif

#define MDF1                      MDF1_NS
#define MDF1_BASE                 MDF1_BASE_NS

#define MDF1_Filter0              MDF1_Filter0_NS
#define MDF1_Filter0_BASE         MDF1_Filter0_BASE_NS

#define MDF1_Filter1              MDF1_Filter1_NS
#define MDF1_Filter1_BASE         MDF1_Filter1_BASE_NS

#define MDF1_Filter2              MDF1_Filter2_NS
#define MDF1_Filter2_BASE         MDF1_Filter2_BASE_NS

#define MDF1_Filter3              MDF1_Filter3_NS
#define MDF1_Filter3_BASE         MDF1_Filter3_BASE_NS

#define MDF1_Filter4              MDF1_Filter4_NS
#define MDF1_Filter4_BASE         MDF1_Filter4_BASE_NS

#define MDF1_Filter5              MDF1_Filter5_NS
#define MDF1_Filter5_BASE         MDF1_Filter5_BASE_NS

