STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32N6xx/Include/stm32n6xxxxx.h
/*****************  Bit definition for DCMIPP_IPIDR register  *****************/
#define DCMIPP_IPIDR_IDR_Pos                (0UL)
#define DCMIPP_IPIDR_IDR_Msk                (0xFFFFFFFFU << DCMIPP_IPIDR_IDR_Pos)           /*!< 0xFFFFFFFF */
#define DCMIPP_IPIDR_IDR                    DCMIPP_IPIDR_IDR_Msk                            /*!< Parallel camera interface (DCMI) and optional pixel processing (PP) */

/*****************  Bit definition for DCMIPP_SIDR register  ******************/
#define DCMIPP_SIDR_SID_Pos                 (0UL)
#define DCMIPP_SIDR_SID_Msk                 (0xFFFFFFFFU << DCMIPP_SIDR_SID_Pos)            /*!< 0xFFFFFFFF */
#define DCMIPP_SIDR_SID                     DCMIPP_SIDR_SID_Msk                             /*!< 4-Kbyte decoding space */

/******************************************************************************/
/*                                                                            */
/*                        Delay Block Interface (DLYBSD)                        */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for DLYBSD_CFGR register  ********************/
#define DLYB_CFGR_SDMMC_DLL_EN_Pos              (0UL)
#define DLYB_CFGR_SDMMC_DLL_EN_Msk              (0x1UL << DLYB_CFGR_SDMMC_DLL_EN_Pos)        /*!< 0x00000001 */
#define DLYB_CFGR_SDMMC_DLL_EN                  DLYB_CFGR_SDMMC_DLL_EN_Msk                   /*!<Delay Block enable */

#define DLYB_CFGR_SDMMC_RX_TAP_SEL_Pos          (1UL)
#define DLYB_CFGR_SDMMC_RX_TAP_SEL_Msk          (0x3FUL << DLYB_CFGR_SDMMC_RX_TAP_SEL_Pos)   /*!< 0x0000007E */
#define DLYB_CFGR_SDMMC_RX_TAP_SEL              DLYB_CFGR_SDMMC_RX_TAP_SEL_Msk               /*!<Select the phase for RX DLYB */
#define DLYB_CFGR_SDMMC_RX_TAP_SEL_0            (0x1UL << DLYB_CFGR_SDMMC_RX_TAP_SEL_Pos)    /*!< 0x00000002 */
#define DLYB_CFGR_SDMMC_RX_TAP_SEL_1            (0x2UL << DLYB_CFGR_SDMMC_RX_TAP_SEL_Pos)    /*!< 0x00000004 */
#define DLYB_CFGR_SDMMC_RX_TAP_SEL_2            (0x4UL << DLYB_CFGR_SDMMC_RX_TAP_SEL_Pos)    /*!< 0x00000008 */
#define DLYB_CFGR_SDMMC_RX_TAP_SEL_3            (0x8UL << DLYB_CFGR_SDMMC_RX_TAP_SEL_Pos)    /*!< 0x00000010 */
#define DLYB_CFGR_SDMMC_RX_TAP_SEL_4            (0x10UL << DLYB_CFGR_SDMMC_RX_TAP_SEL_Pos)   /*!< 0x00000020 */
#define DLYB_CFGR_SDMMC_RX_TAP_SEL_5            (0x20UL << DLYB_CFGR_SDMMC_RX_TAP_SEL_Pos)   /*!< 0x00000040 */

#define DLYB_CFGR_SDMMC_DLL_BYP_EN_Pos          (16UL)
#define DLYB_CFGR_SDMMC_DLL_BYP_EN_Msk          (0x1UL << DLYB_CFGR_SDMMC_DLL_BYP_EN_Pos)    /*!< 0x00010000 */
#define DLYB_CFGR_SDMMC_DLL_BYP_EN              DLYB_CFGR_SDMMC_DLL_BYP_EN_Msk               /*!< DLYB Bypass mode enable */

#define DLYB_CFGR_SDMMC_DLL_BYP_CMD_Pos         (17UL)
#define DLYB_CFGR_SDMMC_DLL_BYP_CMD_Msk         (0x1FUL << DLYB_CFGR_SDMMC_DLL_BYP_CMD_Pos)   /*!< 0x003E0000 */
#define DLYB_CFGR_SDMMC_DLL_BYP_CMD             DLYB_CFGR_SDMMC_DLL_BYP_CMD_Msk                /*!<Select Taps values */
#define DLYB_CFGR_SDMMC_DLL_BYP_CMD_0           (0x1UL << DLYB_CFGR_SDMMC_DLL_BYP_CMD_Pos)    /*!< 0x00010000 */
#define DLYB_CFGR_SDMMC_DLL_BYP_CMD_1           (0x2UL << DLYB_CFGR_SDMMC_DLL_BYP_CMD_Pos)    /*!< 0x00020000 */
#define DLYB_CFGR_SDMMC_DLL_BYP_CMD_2           (0x4UL << DLYB_CFGR_SDMMC_DLL_BYP_CMD_Pos)    /*!< 0x00040000 */
#define DLYB_CFGR_SDMMC_DLL_BYP_CMD_3           (0x8UL << DLYB_CFGR_SDMMC_DLL_BYP_CMD_Pos)    /*!< 0x00080000 */
#define DLYB_CFGR_SDMMC_DLL_BYP_CMD_4           (0x10UL << DLYB_CFGR_SDMMC_DLL_BYP_CMD_Pos)   /*!< 0x00100000 */

#define DLYB_CFGR_SDMMC_DLL_ANTIGLITCH_EN_Pos   (22UL)
#define DLYB_CFGR_SDMMC_DLL_ANTIGLITCH_EN_Msk   (0x1UL << DLYB_CFGR_SDMMC_DLL_ANTIGLITCH_EN_Pos) /*!< 0x00010000 */
#define DLYB_CFGR_SDMMC_DLL_ANTIGLITCH_EN       DLYB_CFGR_SDMMC_DLL_ANTIGLITCH_EN_Msk            /*!<Enable Antiglitch  */

/*******************  Bit definition for DLYBSD_STATUS register  *******************/

#define DLYB_STATUS_SDMMC_DLL_LOCK_Pos          (0UL)
#define DLYB_STATUS_SDMMC_DLL_LOCK_Msk          (0x1UL << DLYB_STATUS_SDMMC_DLL_LOCK_Pos)     /*!< 0x00000001 */
#define DLYB_STATUS_SDMMC_DLL_LOCK              DLYB_STATUS_SDMMC_DLL_LOCK_Msk                /*!<DLYB lock mode enable */

#define DLYB_STATUS_SDMMC_RX_TAP_SEL_ACK_Pos    (1UL)                                            
#define DLYB_STATUS_SDMMC_RX_TAP_SEL_ACK_Msk    (0x1UL << DLYB_STATUS_SDMMC_RX_TAP_SEL_ACK_Pos)  /*!< 0x00000002 */
#define DLYB_STATUS_SDMMC_RX_TAP_SEL_ACK        DLYB_STATUS_SDMMC_RX_TAP_SEL_ACK_Msk             /*!< RX delay selection acknowledge */

/******************************************************************************/
/*                                                                            */
/*                           DMA Controller (DMA)                             */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for DMA_SECCFGR register  ****************/
#define DMA_SECCFGR_SEC0_Pos     (0UL)
#define DMA_SECCFGR_SEC0_Msk     (0x1UL << DMA_SECCFGR_SEC0_Pos)                /*!< 0x00000001 */
#define DMA_SECCFGR_SEC0         DMA_SECCFGR_SEC0_Msk                          /*!< Secure State of Channel 0 */
#define DMA_SECCFGR_SEC1_Pos     (1UL)
#define DMA_SECCFGR_SEC1_Msk     (0x1UL << DMA_SECCFGR_SEC1_Pos)                /*!< 0x00000002 */
#define DMA_SECCFGR_SEC1         DMA_SECCFGR_SEC1_Msk                          /*!< Secure State of Channel 1 */
#define DMA_SECCFGR_SEC2_Pos     (2UL)
#define DMA_SECCFGR_SEC2_Msk     (0x1UL << DMA_SECCFGR_SEC2_Pos)                /*!< 0x00000004 */
#define DMA_SECCFGR_SEC2         DMA_SECCFGR_SEC2_Msk                          /*!< Secure State of Channel 2 */
#define DMA_SECCFGR_SEC3_Pos     (3UL)
#define DMA_SECCFGR_SEC3_Msk     (0x1UL << DMA_SECCFGR_SEC3_Pos)                /*!< 0x00000008 */
#define DMA_SECCFGR_SEC3         DMA_SECCFGR_SEC3_Msk                          /*!< Secure State of Channel 3 */
#define DMA_SECCFGR_SEC4_Pos     (4UL)
#define DMA_SECCFGR_SEC4_Msk     (0x1UL << DMA_SECCFGR_SEC4_Pos)                /*!< 0x00000010 */
#define DMA_SECCFGR_SEC4         DMA_SECCFGR_SEC4_Msk                          /*!< Secure State of Channel 4 */
#define DMA_SECCFGR_SEC5_Pos     (5UL)
#define DMA_SECCFGR_SEC5_Msk     (0x1UL << DMA_SECCFGR_SEC5_Pos)                /*!< 0x00000020 */
#define DMA_SECCFGR_SEC5         DMA_SECCFGR_SEC5_Msk                          /*!< Secure State of Channel 5 */
#define DMA_SECCFGR_SEC6_Pos     (6UL)
#define DMA_SECCFGR_SEC6_Msk     (0x1UL << DMA_SECCFGR_SEC6_Pos)                /*!< 0x00000040 */
#define DMA_SECCFGR_SEC6         DMA_SECCFGR_SEC6_Msk                          /*!< Secure State of Channel 6 */
#define DMA_SECCFGR_SEC7_Pos     (7UL)
#define DMA_SECCFGR_SEC7_Msk     (0x1UL << DMA_SECCFGR_SEC7_Pos)                /*!< 0x00000080 */
#define DMA_SECCFGR_SEC7         DMA_SECCFGR_SEC7_Msk                          /*!< Secure State of Channel 7 */
#define DMA_SECCFGR_SEC8_Pos     (8UL)
#define DMA_SECCFGR_SEC8_Msk     (0x1UL << DMA_SECCFGR_SEC8_Pos)                /*!< 0x00000100 */
#define DMA_SECCFGR_SEC8         DMA_SECCFGR_SEC8_Msk                          /*!< Secure State of Channel 8 */
#define DMA_SECCFGR_SEC9_Pos     (9UL)
#define DMA_SECCFGR_SEC9_Msk     (0x1UL << DMA_SECCFGR_SEC9_Pos)                /*!< 0x00000200 */
#define DMA_SECCFGR_SEC9         DMA_SECCFGR_SEC9_Msk                          /*!< Secure State of Channel 9 */
#define DMA_SECCFGR_SEC10_Pos    (10UL)
#define DMA_SECCFGR_SEC10_Msk    (0x1UL << DMA_SECCFGR_SEC10_Pos)               /*!< 0x00000400 */
#define DMA_SECCFGR_SEC10        DMA_SECCFGR_SEC10_Msk                         /*!< Secure State of Channel 10 */
#define DMA_SECCFGR_SEC11_Pos    (11UL)
#define DMA_SECCFGR_SEC11_Msk    (0x1UL << DMA_SECCFGR_SEC11_Pos)               /*!< 0x00000800 */
#define DMA_SECCFGR_SEC11        DMA_SECCFGR_SEC11_Msk                         /*!< Secure State of Channel 11 */
#define DMA_SECCFGR_SEC12_Pos    (12UL)
#define DMA_SECCFGR_SEC12_Msk    (0x1UL << DMA_SECCFGR_SEC12_Pos)               /*!< 0x00001000 */
#define DMA_SECCFGR_SEC12        DMA_SECCFGR_SEC12_Msk                         /*!< Secure State of Channel 12 */
#define DMA_SECCFGR_SEC13_Pos    (13UL)
#define DMA_SECCFGR_SEC13_Msk    (0x1UL << DMA_SECCFGR_SEC13_Pos)               /*!< 0x00002000 */
#define DMA_SECCFGR_SEC13        DMA_SECCFGR_SEC13_Msk                         /*!< Secure State of Channel 13 */
#define DMA_SECCFGR_SEC14_Pos    (14UL)
#define DMA_SECCFGR_SEC14_Msk    (0x1UL << DMA_SECCFGR_SEC14_Pos)               /*!< 0x00004000 */
#define DMA_SECCFGR_SEC14        DMA_SECCFGR_SEC14_Msk                         /*!< Secure State of Channel 14 */
#define DMA_SECCFGR_SEC15_Pos    (15UL)
#define DMA_SECCFGR_SEC15_Msk    (0x1UL << DMA_SECCFGR_SEC15_Pos)               /*!< 0x00008000 */
#define DMA_SECCFGR_SEC15        DMA_SECCFGR_SEC14_Msk                         /*!< Secure State of Channel 15 */

