STMicroelectronics/x-cube-freertos/Drivers/CMSIS/Device/ST/STM32N6xx/Include/stm32n6xxxxx.h
/******************* TIM Instances : Timer input selection ********************/
#define IS_TIM_TISEL_INSTANCE(INSTANCE)    (((INSTANCE) == TIM2_S)  || ((INSTANCE) == TIM2_NS)  || \
                                            ((INSTANCE) == TIM3_S)  || ((INSTANCE) == TIM3_NS)  || \
                                            ((INSTANCE) == TIM5_S)  || ((INSTANCE) == TIM5_NS)  || \
                                            ((INSTANCE) == TIM9_S)  || ((INSTANCE) == TIM9_NS)  || \
                                            ((INSTANCE) == TIM10_S) || ((INSTANCE) == TIM10_NS) || \
                                            ((INSTANCE) == TIM11_S) || ((INSTANCE) == TIM11_NS) || \
                                            ((INSTANCE) == TIM12_S) || ((INSTANCE) == TIM12_NS) || \
                                            ((INSTANCE) == TIM13_S) || ((INSTANCE) == TIM13_NS) || \
                                            ((INSTANCE) == TIM14_S) || ((INSTANCE) == TIM14_NS) || \
                                            ((INSTANCE) == TIM15_S) || ((INSTANCE) == TIM15_NS) || \
                                            ((INSTANCE) == TIM16_S) || ((INSTANCE) == TIM16_NS) || \
                                            ((INSTANCE) == TIM17_S) || ((INSTANCE) == TIM17_NS))

/****************** TIM Instances : Advanced timer instances *******************/
#define IS_TIM_ADVANCED_INSTANCE(INSTANCE) (((INSTANCE) == TIM1_S) || ((INSTANCE) == TIM1_NS) || \
                                            ((INSTANCE) == TIM8_S) || ((INSTANCE) == TIM8_NS))

/****************************** WWDG Instances *******************************/
#define IS_WWDG_ALL_INSTANCE(INSTANCE) (((INSTANCE) == WWDG_S) || ((INSTANCE) == WWDG_NS))

/******************************** XSPI Instances *****************************/
#define IS_XSPI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == XSPI1_S) || ((INSTANCE) == XSPI1_NS) || \
                                        ((INSTANCE) == XSPI2_S) || ((INSTANCE) == XSPI2_NS) || \
                                        ((INSTANCE) == XSPI3_S) || ((INSTANCE) == XSPI3_NS))

/****************************** XSPIM Instances ***************************/
#define IS_XSPIM_ALL_INSTANCE(INSTANCE) (((INSTANCE) == XSPIM_S) || ((INSTANCE) == XSPIM_NS))

#else
/* Instances allowed from Non-Secure state - only alias Non-Secure */

/******************************* ADC Instances *******************************/
#define IS_ADC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == ADC1_NS) || \
                                       ((INSTANCE) == ADC2_NS))

#define IS_ADC_MULTIMODE_MASTER_INSTANCE(INSTANCE) ((INSTANCE) == ADC1_NS)

#define IS_ADC_COMMON_INSTANCE(INSTANCE) ((INSTANCE) == ADC12_COMMON_NS)

#if $N6_NPU$
/******************************* CACHEAXI Instances ***************************/
#define IS_CACHEAXI_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CACHEAXI_NS)

#endif
/******************************* CRC Instances *******************************/
#define IS_CRC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CRC_NS)

/******************************* DCMI Instances ******************************/
#define IS_DCMI_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DCMI_NS)

/******************************* DCMIPP Instances ****************************/
#define IS_DCMIPP_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DCMIPP_NS)

/******************************* DLYB Instances ****************************/
#define IS_DLYB_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DLYB_SDMMC1_NS) || \
                                        ((INSTANCE) == DLYB_SDMMC2_NS))

/******************************** DMA Instances ******************************/
#define IS_DMA_ALL_INSTANCE(INSTANCE) (((INSTANCE) == GPDMA1_Channel0_NS) || \
                                       ((INSTANCE) == GPDMA1_Channel1_NS) || \
                                       ((INSTANCE) == GPDMA1_Channel2_NS) || \
                                       ((INSTANCE) == GPDMA1_Channel3_NS) || \
                                       ((INSTANCE) == GPDMA1_Channel4_NS) || \
                                       ((INSTANCE) == GPDMA1_Channel5_NS) || \
                                       ((INSTANCE) == GPDMA1_Channel6_NS) || \
                                       ((INSTANCE) == GPDMA1_Channel7_NS) || \
                                       ((INSTANCE) == GPDMA1_Channel8_NS) || \
                                       ((INSTANCE) == GPDMA1_Channel9_NS) || \
                                       ((INSTANCE) == GPDMA1_Channel10_NS) || \
                                       ((INSTANCE) == GPDMA1_Channel11_NS) || \
                                       ((INSTANCE) == GPDMA1_Channel12_NS) || \
                                       ((INSTANCE) == GPDMA1_Channel13_NS) || \
                                       ((INSTANCE) == GPDMA1_Channel14_NS) || \
                                       ((INSTANCE) == GPDMA1_Channel15_NS) || \
                                       ((INSTANCE) == HPDMA1_Channel0_NS) || \
                                       ((INSTANCE) == HPDMA1_Channel1_NS) || \
                                       ((INSTANCE) == HPDMA1_Channel2_NS) || \
                                       ((INSTANCE) == HPDMA1_Channel3_NS) || \
                                       ((INSTANCE) == HPDMA1_Channel4_NS) || \
                                       ((INSTANCE) == HPDMA1_Channel5_NS) || \
                                       ((INSTANCE) == HPDMA1_Channel6_NS) || \
                                       ((INSTANCE) == HPDMA1_Channel7_NS) || \
                                       ((INSTANCE) == HPDMA1_Channel8_NS) || \
                                       ((INSTANCE) == HPDMA1_Channel9_NS) || \
                                       ((INSTANCE) == HPDMA1_Channel10_NS) || \
                                       ((INSTANCE) == HPDMA1_Channel11_NS) || \
                                       ((INSTANCE) == HPDMA1_Channel12_NS) || \
                                       ((INSTANCE) == HPDMA1_Channel13_NS) || \
                                       ((INSTANCE) == HPDMA1_Channel14_NS) || \
                                       ((INSTANCE) == HPDMA1_Channel15_NS))

